Ran Plan for dir: `project_1` workspace: `default`

<details><summary>Show Output</summary>

```diff
[0m[1mUpgrading modules...[0m
- buckets in ../modules/buckets
- service_accounts in ../modules/service_accounts
- vm_instance in ../modules/vm_instance
- vpc_network in ../modules/vpc_network

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding latest version of hashicorp/google...
- Installing hashicorp/google v6.43.0...
- Installed hashicorp/google v6.43.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

Acquiring state lock. This may take a few moments...
[0m[1mmodule.vm_instance.google_compute_firewall.allow_ssh: Refreshing state... [id=projects/sunlit-cab-463104-m6/global/firewalls/allow-ssh][0m
[0m[1mmodule.vm_instance.google_compute_disk.extra_disk["geetass-vm-1"]: Refreshing state... [id=projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/disks/geetass-vm-1-extra-disk][0m
[0m[1mmodule.vm_instance.google_compute_disk.extra_disk["geetass-vm-2"]: Refreshing state... [id=projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/disks/geetass-vm-2-extra-disk][0m
[0m[1mmodule.vm_instance.google_compute_disk.extra_disk["sandeepss-vm-1"]: Refreshing state... [id=projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/disks/sandeepss-vm-1-extra-disk][0m
[0m[1mmodule.vm_instance.google_compute_disk.extra_disk["yashwantss-vm-1"]: Refreshing state... [id=projects/sunlit-cab-463104-m6/zones/asia-southeast1-b/disks/yashwantss-vm-1-extra-disk][0m
[0m[1mmodule.vm_instance.google_compute_disk.extra_disk["yahswantss-vm-2"]: Refreshing state... [id=projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/disks/yahswantss-vm-2-extra-disk][0m
[0m[1mmodule.vm_instance.google_compute_instance.vm_sandeep_tf["yahswantss-vm-2"]: Refreshing state... [id=projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/instances/yahswantss-vm-2][0m
[0m[1mmodule.vm_instance.google_compute_instance.vm_sandeep_tf["geetass-vm-1"]: Refreshing state... [id=projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/instances/geetass-vm-1][0m
[0m[1mmodule.vm_instance.google_compute_instance.vm_sandeep_tf["sandeepss-vm-1"]: Refreshing state... [id=projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/instances/sandeepss-vm-1][0m
[0m[1mmodule.vm_instance.google_compute_instance.vm_sandeep_tf["geetass-vm-2"]: Refreshing state... [id=projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/instances/geetass-vm-2][0m
[0m[1mmodule.vm_instance.google_compute_instance.vm_sandeep_tf["yashwantss-vm-1"]: Refreshing state... [id=projects/sunlit-cab-463104-m6/zones/asia-southeast1-b/instances/yashwantss-vm-1][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
  [31m-[0m destroy
[0m
Terraform will perform the following actions:

[1m  # module.vm_instance.google_compute_disk.extra_disk["geeta-1"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_disk" "extra_disk" {
      [32m+[0m [0m[1m[0maccess_mode[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcreate_snapshot_before_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mdisk_id[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0meffective_labels[0m[0m               = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mlast_attach_timestamp[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlast_detach_timestamp[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlicenses[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                           = "geeta-1-extra-disk"
      [32m+[0m [0m[1m[0mphysical_block_size_bytes[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                        = "sunlit-cab-463104-m6"
      [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0msize[0m[0m                           = 50
      [32m+[0m [0m[1m[0msource_disk_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0msource_image_id[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msource_instant_snapshot_id[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0msource_snapshot_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mterraform_labels[0m[0m               = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mtype[0m[0m                           = "pd-standard"
      [32m+[0m [0m[1m[0musers[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                           = "asia-southeast1-a"

      [32m+[0m [0mguest_os_features {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)
        }
    }

[1m  # module.vm_instance.google_compute_disk.extra_disk["geeta-2"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_disk" "extra_disk" {
      [32m+[0m [0m[1m[0maccess_mode[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcreate_snapshot_before_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mdisk_id[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0meffective_labels[0m[0m               = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mlast_attach_timestamp[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlast_detach_timestamp[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlicenses[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                           = "geeta-2-extra-disk"
      [32m+[0m [0m[1m[0mphysical_block_size_bytes[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                        = "sunlit-cab-463104-m6"
      [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0msize[0m[0m                           = 50
      [32m+[0m [0m[1m[0msource_disk_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0msource_image_id[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msource_instant_snapshot_id[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0msource_snapshot_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mterraform_labels[0m[0m               = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mtype[0m[0m                           = "pd-standard"
      [32m+[0m [0m[1m[0musers[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                           = "asia-southeast1-a"

      [32m+[0m [0mguest_os_features {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)
        }
    }

[1m  # module.vm_instance.google_compute_disk.extra_disk["geetass-vm-1"][0m will be [1m[31mdestroyed[0m[0m
[0m  [31m-[0m[0m resource "google_compute_disk" "extra_disk" {
      [31m-[0m [0m[1m[0mcreate_snapshot_before_destroy[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcreation_timestamp[0m[0m             = "2025-07-09T22:34:53.283-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdisk_id[0m[0m                        = "2407162261455171090" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0meffective_labels[0m[0m               = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_confidential_compute[0m[0m    = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                             = "projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/disks/geetass-vm-1-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabel_fingerprint[0m[0m              = "vezUS-42LLM=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabels[0m[0m                         = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlast_attach_timestamp[0m[0m          = "2025-07-09T22:35:07.401-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlicenses[0m[0m                       = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m                           = "geetass-vm-1-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mphysical_block_size_bytes[0m[0m      = 4096 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m                        = "sunlit-cab-463104-m6" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mprovisioned_iops[0m[0m               = 0 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mprovisioned_throughput[0m[0m         = 0 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m                      = "https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/disks/geetass-vm-1-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0msize[0m[0m                           = 50 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mterraform_labels[0m[0m               = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtype[0m[0m                           = "pd-standard" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0musers[0m[0m                          = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/instances/geetass-vm-1",
        ] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mzone[0m[0m                           = "asia-southeast1-a" [90m->[0m [0m[90mnull[0m[0m
    }

[1m  # module.vm_instance.google_compute_disk.extra_disk["geetass-vm-2"][0m will be [1m[31mdestroyed[0m[0m
[0m  [31m-[0m[0m resource "google_compute_disk" "extra_disk" {
      [31m-[0m [0m[1m[0mcreate_snapshot_before_destroy[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcreation_timestamp[0m[0m             = "2025-07-09T22:34:53.293-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdisk_id[0m[0m                        = "7715487555772411410" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0meffective_labels[0m[0m               = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_confidential_compute[0m[0m    = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                             = "projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/disks/geetass-vm-2-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabel_fingerprint[0m[0m              = "vezUS-42LLM=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabels[0m[0m                         = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlast_attach_timestamp[0m[0m          = "2025-07-09T22:35:07.639-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlicenses[0m[0m                       = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m                           = "geetass-vm-2-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mphysical_block_size_bytes[0m[0m      = 4096 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m                        = "sunlit-cab-463104-m6" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mprovisioned_iops[0m[0m               = 0 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mprovisioned_throughput[0m[0m         = 0 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m                      = "https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/disks/geetass-vm-2-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0msize[0m[0m                           = 50 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mterraform_labels[0m[0m               = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtype[0m[0m                           = "pd-standard" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0musers[0m[0m                          = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/instances/geetass-vm-2",
        ] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mzone[0m[0m                           = "asia-southeast1-a" [90m->[0m [0m[90mnull[0m[0m
    }

[1m  # module.vm_instance.google_compute_disk.extra_disk["sandeep-1"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_disk" "extra_disk" {
      [32m+[0m [0m[1m[0maccess_mode[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcreate_snapshot_before_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mdisk_id[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0meffective_labels[0m[0m               = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mlast_attach_timestamp[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlast_detach_timestamp[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlicenses[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                           = "sandeep-1-extra-disk"
      [32m+[0m [0m[1m[0mphysical_block_size_bytes[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                        = "sunlit-cab-463104-m6"
      [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0msize[0m[0m                           = 50
      [32m+[0m [0m[1m[0msource_disk_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0msource_image_id[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msource_instant_snapshot_id[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0msource_snapshot_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mterraform_labels[0m[0m               = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mtype[0m[0m                           = "pd-standard"
      [32m+[0m [0m[1m[0musers[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                           = "asia-southeast1-a"

      [32m+[0m [0mguest_os_features {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)
        }
    }

[1m  # module.vm_instance.google_compute_disk.extra_disk["sandeepss-vm-1"][0m will be [1m[31mdestroyed[0m[0m
[0m  [31m-[0m[0m resource "google_compute_disk" "extra_disk" {
      [31m-[0m [0m[1m[0mcreate_snapshot_before_destroy[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcreation_timestamp[0m[0m             = "2025-07-09T22:34:53.298-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdisk_id[0m[0m                        = "2292671648958180882" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0meffective_labels[0m[0m               = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_confidential_compute[0m[0m    = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                             = "projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/disks/sandeepss-vm-1-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabel_fingerprint[0m[0m              = "vezUS-42LLM=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabels[0m[0m                         = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlast_attach_timestamp[0m[0m          = "2025-07-09T22:35:07.498-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlicenses[0m[0m                       = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m                           = "sandeepss-vm-1-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mphysical_block_size_bytes[0m[0m      = 4096 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m                        = "sunlit-cab-463104-m6" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mprovisioned_iops[0m[0m               = 0 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mprovisioned_throughput[0m[0m         = 0 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m                      = "https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/disks/sandeepss-vm-1-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0msize[0m[0m                           = 50 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mterraform_labels[0m[0m               = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtype[0m[0m                           = "pd-standard" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0musers[0m[0m                          = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/instances/sandeepss-vm-1",
        ] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mzone[0m[0m                           = "asia-southeast1-a" [90m->[0m [0m[90mnull[0m[0m
    }

[1m  # module.vm_instance.google_compute_disk.extra_disk["yahswant-2"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_disk" "extra_disk" {
      [32m+[0m [0m[1m[0maccess_mode[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcreate_snapshot_before_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mdisk_id[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0meffective_labels[0m[0m               = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mlast_attach_timestamp[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlast_detach_timestamp[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlicenses[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                           = "yahswant-2-extra-disk"
      [32m+[0m [0m[1m[0mphysical_block_size_bytes[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                        = "sunlit-cab-463104-m6"
      [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0msize[0m[0m                           = 50
      [32m+[0m [0m[1m[0msource_disk_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0msource_image_id[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msource_instant_snapshot_id[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0msource_snapshot_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mterraform_labels[0m[0m               = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mtype[0m[0m                           = "pd-standard"
      [32m+[0m [0m[1m[0musers[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                           = "asia-southeast1-a"

      [32m+[0m [0mguest_os_features {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)
        }
    }

[1m  # module.vm_instance.google_compute_disk.extra_disk["yahswantss-vm-2"][0m will be [1m[31mdestroyed[0m[0m
[0m  [31m-[0m[0m resource "google_compute_disk" "extra_disk" {
      [31m-[0m [0m[1m[0mcreate_snapshot_before_destroy[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcreation_timestamp[0m[0m             = "2025-07-09T22:34:53.235-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdisk_id[0m[0m                        = "4405730206367804946" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0meffective_labels[0m[0m               = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_confidential_compute[0m[0m    = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                             = "projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/disks/yahswantss-vm-2-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabel_fingerprint[0m[0m              = "vezUS-42LLM=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabels[0m[0m                         = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlast_attach_timestamp[0m[0m          = "2025-07-09T22:35:07.389-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlicenses[0m[0m                       = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m                           = "yahswantss-vm-2-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mphysical_block_size_bytes[0m[0m      = 4096 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m                        = "sunlit-cab-463104-m6" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mprovisioned_iops[0m[0m               = 0 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mprovisioned_throughput[0m[0m         = 0 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m                      = "https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/disks/yahswantss-vm-2-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0msize[0m[0m                           = 50 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mterraform_labels[0m[0m               = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtype[0m[0m                           = "pd-standard" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0musers[0m[0m                          = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/instances/yahswantss-vm-2",
        ] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mzone[0m[0m                           = "asia-southeast1-a" [90m->[0m [0m[90mnull[0m[0m
    }

[1m  # module.vm_instance.google_compute_disk.extra_disk["yashwant-1"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_disk" "extra_disk" {
      [32m+[0m [0m[1m[0maccess_mode[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcreate_snapshot_before_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mdisk_id[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0meffective_labels[0m[0m               = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mlast_attach_timestamp[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlast_detach_timestamp[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlicenses[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                           = "yashwant-1-extra-disk"
      [32m+[0m [0m[1m[0mphysical_block_size_bytes[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                        = "sunlit-cab-463104-m6"
      [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0msize[0m[0m                           = 50
      [32m+[0m [0m[1m[0msource_disk_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0msource_image_id[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msource_instant_snapshot_id[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0msource_snapshot_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mterraform_labels[0m[0m               = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mtype[0m[0m                           = "pd-standard"
      [32m+[0m [0m[1m[0musers[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                           = "asia-southeast1-b"

      [32m+[0m [0mguest_os_features {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)
        }
    }

[1m  # module.vm_instance.google_compute_disk.extra_disk["yashwantss-vm-1"][0m will be [1m[31mdestroyed[0m[0m
[0m  [31m-[0m[0m resource "google_compute_disk" "extra_disk" {
      [31m-[0m [0m[1m[0mcreate_snapshot_before_destroy[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcreation_timestamp[0m[0m             = "2025-07-09T22:34:53.256-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdisk_id[0m[0m                        = "1016642315630079506" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0meffective_labels[0m[0m               = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_confidential_compute[0m[0m    = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                             = "projects/sunlit-cab-463104-m6/zones/asia-southeast1-b/disks/yashwantss-vm-1-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabel_fingerprint[0m[0m              = "vezUS-42LLM=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabels[0m[0m                         = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlast_attach_timestamp[0m[0m          = "2025-07-09T22:35:07.983-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlicenses[0m[0m                       = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m                           = "yashwantss-vm-1-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mphysical_block_size_bytes[0m[0m      = 4096 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m                        = "sunlit-cab-463104-m6" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mprovisioned_iops[0m[0m               = 0 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mprovisioned_throughput[0m[0m         = 0 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m                      = "https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-b/disks/yashwantss-vm-1-extra-disk" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0msize[0m[0m                           = 50 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mterraform_labels[0m[0m               = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtype[0m[0m                           = "pd-standard" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0musers[0m[0m                          = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-b/instances/yashwantss-vm-1",
        ] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mzone[0m[0m                           = "asia-southeast1-b" [90m->[0m [0m[90mnull[0m[0m
    }

[1m  # module.vm_instance.google_compute_instance.vm_sandeep_tf["geeta-1"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_instance" "vm_sandeep_tf" {
      [32m+[0m [0m[1m[0mcan_ip_forward[0m[0m       = false
      [32m+[0m [0m[1m[0mcpu_platform[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mcurrent_status[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m  = false
      [32m+[0m [0m[1m[0meffective_labels[0m[0m     = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0minstance_id[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mmachine_type[0m[0m         = "e2-small"
      [32m+[0m [0m[1m[0mmetadata[0m[0m             = {
          [32m+[0m [0m"ssh-keys" = <<-EOT
                ansible-user:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDM3U+EqWPgKVjR9e0YCDGp/q5ju89ripPSWIz5oSLaYcRvihKGJ2/KERQBw+xJvOf0vfLAEp+MCL0pZEKnAmio6hx5bQiABzVQqepEjrAWXkHveI7bzW/J1cHbNwiCaO/YTzKKqc6VlSd+3jqEEcGSrZgEK0VmILKd2GTscvzJMdvuDKDwgOdw1dp++5O6T2Q8c6qySpSPoio6XG4qQzhBVtwT4EnRXGMZq9UR+TGf8KuzPUWqCBdD+lw6wt7X6uhcnllXrUf86SPA/m/aloN5AxNL6N/yrr+7Uqvof83bQX++EXa+KQMaMcSLVmn2AOhh+PHtYr2IwlszAXKPb61Qw2XTDB6R0fy8w7FiKUo4wSI6CxtG0l0wTu5bBs6TNBzxL5a1fTdE8MHJGibC5MGShFoNqoldLLG+6JCMJ+dQzg2vs6D/EGjX87j1laZJ9Q1OjcrfkadhRsvOgKOWRlQNwtgLIN8WFlT/HRYz0ov4Zj8vhTDwNMj5o1EcR8SwwxB9VhN6+KaouFgVy4yXxCDtK6yvEaopxWyQwTpergw81uVBaFwHFqZkMyhhBlYsPlXHLbXj3PfVZsXD9Q9TA4PjS+loNBveyjxNG4/AxhJapWlqz3GXbFM3UOHB4xSoGzvmUdB/0yy9yXbMFMsyF/hWY7hfm4ow+XaS3cSmnMjI5w== ansible-user
            EOT
        }
      [32m+[0m [0m[1m[0mmetadata_fingerprint[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                 = "geeta-1"
      [32m+[0m [0m[1m[0mproject[0m[0m              = "sunlit-cab-463104-m6"
      [32m+[0m [0m[1m[0mself_link[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                 = [
          [32m+[0m [0m"allow-ssh",
          [32m+[0m [0m"ansible",
          [32m+[0m [0m"env",
          [32m+[0m [0m"http-server",
          [32m+[0m [0m"https-server",
          [32m+[0m [0m"postgres",
          [32m+[0m [0m"ssh",
        ]
      [32m+[0m [0m[1m[0mtags_fingerprint[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mterraform_labels[0m[0m     = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mzone[0m[0m                 = "asia-southeast1-a"

      [32m+[0m [0mattached_disk {
          [32m+[0m [0m[1m[0mdevice_name[0m[0m                = "extra-disk"
          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmode[0m[0m                       = "READ_WRITE"
          [32m+[0m [0m[1m[0msource[0m[0m                     = (known after apply)
        }

      [32m+[0m [0mboot_disk {
          [32m+[0m [0m[1m[0mauto_delete[0m[0m                = true
          [32m+[0m [0m[1m[0mdevice_name[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mguest_os_features[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmode[0m[0m                       = "READ_WRITE"
          [32m+[0m [0m[1m[0msource[0m[0m                     = (known after apply)

          [32m+[0m [0minitialize_params {
              [32m+[0m [0m[1m[0marchitecture[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0mimage[0m[0m                  = "rocky-linux-9-v20250611"
              [32m+[0m [0m[1m[0mlabels[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mresource_policies[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0msize[0m[0m                   = 20
              [32m+[0m [0m[1m[0msnapshot[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mtype[0m[0m                   = (known after apply)
            }
        }

      [32m+[0m [0mconfidential_instance_config {
          [32m+[0m [0m[1m[0mconfidential_instance_type[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m = (known after apply)
        }

      [32m+[0m [0mguest_accelerator {
          [32m+[0m [0m[1m[0mcount[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m  = (known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0minternal_ipv6_prefix_length[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mipv6_access_type[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mipv6_address[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mnetwork[0m[0m                     = "default"
          [32m+[0m [0m[1m[0mnetwork_attachment[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_ip[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mstack_type[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork_project[0m[0m          = (known after apply)

          [32m+[0m [0maccess_config {
              [32m+[0m [0m[1m[0mnat_ip[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mnetwork_tier[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mreservation_affinity {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)

          [32m+[0m [0mspecific_reservation {
              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mscheduling {
          [32m+[0m [0m[1m[0mautomatic_restart[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mavailability_domain[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0minstance_termination_action[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmin_node_cpus[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mon_host_maintenance[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mprovisioning_model[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mtermination_time[0m[0m            = (known after apply)

          [32m+[0m [0mlocal_ssd_recovery_timeout {
              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mmax_run_duration {
              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mnode_affinities {
              [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)
            }

          [32m+[0m [0mon_instance_stop_action {
              [32m+[0m [0m[1m[0mdiscard_local_ssd[0m[0m = (known after apply)
            }
        }
    }

[1m  # module.vm_instance.google_compute_instance.vm_sandeep_tf["geeta-2"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_instance" "vm_sandeep_tf" {
      [32m+[0m [0m[1m[0mcan_ip_forward[0m[0m       = false
      [32m+[0m [0m[1m[0mcpu_platform[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mcurrent_status[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m  = false
      [32m+[0m [0m[1m[0meffective_labels[0m[0m     = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0minstance_id[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mmachine_type[0m[0m         = "e2-small"
      [32m+[0m [0m[1m[0mmetadata[0m[0m             = {
          [32m+[0m [0m"ssh-keys" = <<-EOT
                ansible-user:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDM3U+EqWPgKVjR9e0YCDGp/q5ju89ripPSWIz5oSLaYcRvihKGJ2/KERQBw+xJvOf0vfLAEp+MCL0pZEKnAmio6hx5bQiABzVQqepEjrAWXkHveI7bzW/J1cHbNwiCaO/YTzKKqc6VlSd+3jqEEcGSrZgEK0VmILKd2GTscvzJMdvuDKDwgOdw1dp++5O6T2Q8c6qySpSPoio6XG4qQzhBVtwT4EnRXGMZq9UR+TGf8KuzPUWqCBdD+lw6wt7X6uhcnllXrUf86SPA/m/aloN5AxNL6N/yrr+7Uqvof83bQX++EXa+KQMaMcSLVmn2AOhh+PHtYr2IwlszAXKPb61Qw2XTDB6R0fy8w7FiKUo4wSI6CxtG0l0wTu5bBs6TNBzxL5a1fTdE8MHJGibC5MGShFoNqoldLLG+6JCMJ+dQzg2vs6D/EGjX87j1laZJ9Q1OjcrfkadhRsvOgKOWRlQNwtgLIN8WFlT/HRYz0ov4Zj8vhTDwNMj5o1EcR8SwwxB9VhN6+KaouFgVy4yXxCDtK6yvEaopxWyQwTpergw81uVBaFwHFqZkMyhhBlYsPlXHLbXj3PfVZsXD9Q9TA4PjS+loNBveyjxNG4/AxhJapWlqz3GXbFM3UOHB4xSoGzvmUdB/0yy9yXbMFMsyF/hWY7hfm4ow+XaS3cSmnMjI5w== ansible-user
            EOT
        }
      [32m+[0m [0m[1m[0mmetadata_fingerprint[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                 = "geeta-2"
      [32m+[0m [0m[1m[0mproject[0m[0m              = "sunlit-cab-463104-m6"
      [32m+[0m [0m[1m[0mself_link[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                 = [
          [32m+[0m [0m"allow-ssh",
          [32m+[0m [0m"ansible",
          [32m+[0m [0m"env",
          [32m+[0m [0m"http-server",
          [32m+[0m [0m"https-server",
          [32m+[0m [0m"postgres",
          [32m+[0m [0m"ssh",
        ]
      [32m+[0m [0m[1m[0mtags_fingerprint[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mterraform_labels[0m[0m     = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mzone[0m[0m                 = "asia-southeast1-a"

      [32m+[0m [0mattached_disk {
          [32m+[0m [0m[1m[0mdevice_name[0m[0m                = "extra-disk"
          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmode[0m[0m                       = "READ_WRITE"
          [32m+[0m [0m[1m[0msource[0m[0m                     = (known after apply)
        }

      [32m+[0m [0mboot_disk {
          [32m+[0m [0m[1m[0mauto_delete[0m[0m                = true
          [32m+[0m [0m[1m[0mdevice_name[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mguest_os_features[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmode[0m[0m                       = "READ_WRITE"
          [32m+[0m [0m[1m[0msource[0m[0m                     = (known after apply)

          [32m+[0m [0minitialize_params {
              [32m+[0m [0m[1m[0marchitecture[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0mimage[0m[0m                  = "rocky-linux-9-v20250611"
              [32m+[0m [0m[1m[0mlabels[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mresource_policies[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0msize[0m[0m                   = 20
              [32m+[0m [0m[1m[0msnapshot[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mtype[0m[0m                   = (known after apply)
            }
        }

      [32m+[0m [0mconfidential_instance_config {
          [32m+[0m [0m[1m[0mconfidential_instance_type[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m = (known after apply)
        }

      [32m+[0m [0mguest_accelerator {
          [32m+[0m [0m[1m[0mcount[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m  = (known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0minternal_ipv6_prefix_length[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mipv6_access_type[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mipv6_address[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mnetwork[0m[0m                     = "default"
          [32m+[0m [0m[1m[0mnetwork_attachment[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_ip[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mstack_type[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork_project[0m[0m          = (known after apply)

          [32m+[0m [0maccess_config {
              [32m+[0m [0m[1m[0mnat_ip[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mnetwork_tier[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mreservation_affinity {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)

          [32m+[0m [0mspecific_reservation {
              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mscheduling {
          [32m+[0m [0m[1m[0mautomatic_restart[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mavailability_domain[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0minstance_termination_action[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmin_node_cpus[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mon_host_maintenance[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mprovisioning_model[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mtermination_time[0m[0m            = (known after apply)

          [32m+[0m [0mlocal_ssd_recovery_timeout {
              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mmax_run_duration {
              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mnode_affinities {
              [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)
            }

          [32m+[0m [0mon_instance_stop_action {
              [32m+[0m [0m[1m[0mdiscard_local_ssd[0m[0m = (known after apply)
            }
        }
    }

[1m  # module.vm_instance.google_compute_instance.vm_sandeep_tf["geetass-vm-1"][0m will be [1m[31mdestroyed[0m[0m
[0m  [31m-[0m[0m resource "google_compute_instance" "vm_sandeep_tf" {
      [31m-[0m [0m[1m[0mcan_ip_forward[0m[0m       = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcpu_platform[0m[0m         = "Intel Broadwell" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcreation_timestamp[0m[0m   = "2025-07-09T22:35:06.212-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcurrent_status[0m[0m       = "RUNNING" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdeletion_protection[0m[0m  = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0meffective_labels[0m[0m     = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_display[0m[0m       = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                   = "projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/instances/geetass-vm-1" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0minstance_id[0m[0m          = "1818050219124912102" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabel_fingerprint[0m[0m    = "vezUS-42LLM=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabels[0m[0m               = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmachine_type[0m[0m         = "e2-small" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmetadata[0m[0m             = {
          [31m-[0m [0m"ssh-keys" = <<-EOT
                ansible-user:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDM3U+EqWPgKVjR9e0YCDGp/q5ju89ripPSWIz5oSLaYcRvihKGJ2/KERQBw+xJvOf0vfLAEp+MCL0pZEKnAmio6hx5bQiABzVQqepEjrAWXkHveI7bzW/J1cHbNwiCaO/YTzKKqc6VlSd+3jqEEcGSrZgEK0VmILKd2GTscvzJMdvuDKDwgOdw1dp++5O6T2Q8c6qySpSPoio6XG4qQzhBVtwT4EnRXGMZq9UR+TGf8KuzPUWqCBdD+lw6wt7X6uhcnllXrUf86SPA/m/aloN5AxNL6N/yrr+7Uqvof83bQX++EXa+KQMaMcSLVmn2AOhh+PHtYr2IwlszAXKPb61Qw2XTDB6R0fy8w7FiKUo4wSI6CxtG0l0wTu5bBs6TNBzxL5a1fTdE8MHJGibC5MGShFoNqoldLLG+6JCMJ+dQzg2vs6D/EGjX87j1laZJ9Q1OjcrfkadhRsvOgKOWRlQNwtgLIN8WFlT/HRYz0ov4Zj8vhTDwNMj5o1EcR8SwwxB9VhN6+KaouFgVy4yXxCDtK6yvEaopxWyQwTpergw81uVBaFwHFqZkMyhhBlYsPlXHLbXj3PfVZsXD9Q9TA4PjS+loNBveyjxNG4/AxhJapWlqz3GXbFM3UOHB4xSoGzvmUdB/0yy9yXbMFMsyF/hWY7hfm4ow+XaS3cSmnMjI5w== ansible-user
            EOT
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmetadata_fingerprint[0m[0m = "tPVEtRJOnx4=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m                 = "geetass-vm-1" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m              = "sunlit-cab-463104-m6" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mresource_policies[0m[0m    = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m            = "https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/instances/geetass-vm-1" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m                 = [
          [31m-[0m [0m"allow-ssh",
          [31m-[0m [0m"ansible",
          [31m-[0m [0m"env",
          [31m-[0m [0m"http-server",
          [31m-[0m [0m"https-server",
          [31m-[0m [0m"postgres",
          [31m-[0m [0m"ssh",
        ] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags_fingerprint[0m[0m     = "Ev9zU2_Wjvk=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mterraform_labels[0m[0m     = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mzone[0m[0m                 = "asia-southeast1-a" [90m->[0m [0m[90mnull[0m[0m

      [31m-[0m [0mattached_disk {
          [31m-[0m [0m[1m[0mdevice_name[0m[0m  = "extra-disk" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mforce_attach[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmode[0m[0m         = "READ_WRITE" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0msource[0m[0m       = "https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/disks/geetass-vm-1-extra-disk" [90m->[0m [0m[90mnull[0m[0m
        }

      [31m-[0m [0mboot_disk {
          [31m-[0m [0m[1m[0mauto_delete[0m[0m       = true [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mdevice_name[0m[0m       = "persistent-disk-0" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mforce_attach[0m[0m      = false [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mguest_os_features[0m[0m = [
              [31m-[0m [0m"UEFI_COMPATIBLE",
              [31m-[0m [0m"VIRTIO_SCSI_MULTIQUEUE",
              [31m-[0m [0m"GVNIC",
              [31m-[0m [0m"SEV_CAPABLE",
              [31m-[0m [0m"SEV_SNP_CAPABLE",
              [31m-[0m [0m"SEV_LIVE_MIGRATABLE",
              [31m-[0m [0m"SEV_LIVE_MIGRATABLE_V2",
              [31m-[0m [0m"IDPF",
              [31m-[0m [0m"TDX_CAPABLE",
            ] [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmode[0m[0m              = "READ_WRITE" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0msource[0m[0m            = "https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/disks/geetass-vm-1" [90m->[0m [0m[90mnull[0m[0m

          [31m-[0m [0minitialize_params {
              [31m-[0m [0m[1m[0marchitecture[0m[0m                = "X86_64" [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0menable_confidential_compute[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mimage[0m[0m                       = "https://www.googleapis.com/compute/v1/projects/rocky-linux-cloud/global/images/rocky-linux-9-v20250611" [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mlabels[0m[0m                      = {} [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mprovisioned_iops[0m[0m            = 0 [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mprovisioned_throughput[0m[0m      = 0 [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mresource_manager_tags[0m[0m       = {} [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mresource_policies[0m[0m           = [] [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0msize[0m[0m                        = 20 [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mtype[0m[0m                        = "pd-standard" [90m->[0m [0m[90mnull[0m[0m
            }
        }

      [31m-[0m [0mnetwork_interface {
          [31m-[0m [0m[1m[0minternal_ipv6_prefix_length[0m[0m = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mname[0m[0m                        = "nic0" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mnetwork[0m[0m                     = "https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/global/networks/default" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mnetwork_ip[0m[0m                  = "10.148.0.25" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mqueue_count[0m[0m                 = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mstack_type[0m[0m                  = "IPV4_ONLY" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0msubnetwork[0m[0m                  = "https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/regions/asia-southeast1/subnetworks/default" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0msubnetwork_project[0m[0m          = "sunlit-cab-463104-m6" [90m->[0m [0m[90mnull[0m[0m

          [31m-[0m [0maccess_config {
              [31m-[0m [0m[1m[0mnat_ip[0m[0m       = "34.87.107.98" [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mnetwork_tier[0m[0m = "PREMIUM" [90m->[0m [0m[90mnull[0m[0m
            }
        }

      [31m-[0m [0mscheduling {
          [31m-[0m [0m[1m[0mautomatic_restart[0m[0m   = true [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mavailability_domain[0m[0m = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmin_node_cpus[0m[0m       = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mon_host_maintenance[0m[0m = "MIGRATE" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mpreemptible[0m[0m         = false [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mprovisioning_model[0m[0m  = "STANDARD" [90m->[0m [0m[90mnull[0m[0m
        }

      [31m-[0m [0mshielded_instance_config {
          [31m-[0m [0m[1m[0menable_integrity_monitoring[0m[0m = true [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0menable_secure_boot[0m[0m          = false [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0menable_vtpm[0m[0m                 = true [90m->[0m [0m[90mnull[0m[0m
        }
    }

[1m  # module.vm_instance.google_compute_instance.vm_sandeep_tf["geetass-vm-2"][0m will be [1m[31mdestroyed[0m[0m
[0m  [31m-[0m[0m resource "google_compute_instance" "vm_sandeep_tf" {
      [31m-[0m [0m[1m[0mcan_ip_forward[0m[0m       = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcpu_platform[0m[0m         = "Intel Broadwell" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcreation_timestamp[0m[0m   = "2025-07-09T22:35:06.352-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcurrent_status[0m[0m       = "RUNNING" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdeletion_protection[0m[0m  = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0meffective_labels[0m[0m     = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_display[0m[0m       = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                   = "projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/instances/geetass-vm-2" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0minstance_id[0m[0m          = "7064351306605064166" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabel_fingerprint[0m[0m    = "vezUS-42LLM=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabels[0m[0m               = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmachine_type[0m[0m         = "e2-small" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmetadata[0m[0m             = {
          [31m-[0m [0m"ssh-keys" = <<-EOT
                ansible-user:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDM3U+EqWPgKVjR9e0YCDGp/q5ju89ripPSWIz5oSLaYcRvihKGJ2/KERQBw+xJvOf0vfLAEp+MCL0pZEKnAmio6hx5bQiABzVQqepEjrAWXkHveI7bzW/J1cHbNwiCaO/YTzKKqc6VlSd+3jqEEcGSrZgEK0VmILKd2GTscvzJMdvuDKDwgOdw1dp++5O6T2Q8c6qySpSPoio6XG4qQzhBVtwT4EnRXGMZq9UR+TGf8KuzPUWqCBdD+lw6wt7X6uhcnllXrUf86SPA/m/aloN5AxNL6N/yrr+7Uqvof83bQX++EXa+KQMaMcSLVmn2AOhh+PHtYr2IwlszAXKPb61Qw2XTDB6R0fy8w7FiKUo4wSI6CxtG0l0wTu5bBs6TNBzxL5a1fTdE8MHJGibC5MGShFoNqoldLLG+6JCMJ+dQzg2vs6D/EGjX87j1laZJ9Q1OjcrfkadhRsvOgKOWRlQNwtgLIN8WFlT/HRYz0ov4Zj8vhTDwNMj5o1EcR8SwwxB9VhN6+KaouFgVy4yXxCDtK6yvEaopxWyQwTpergw81uVBaFwHFqZkMyhhBlYsPlXHLbXj3PfVZsXD9Q9TA4PjS+loNBveyjxNG4/AxhJapWlqz3GXbFM3UOHB4xSoGzvmUdB/0yy9yXbMFMsyF/hWY7hfm4ow+XaS3cSmnMjI5w== ansible-user
            EOT
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmetadata_fingerprint[0m[0m = "tPVEtRJOnx4=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m                 = "geetass-vm-2" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m              = "sunlit-cab-463104-m6" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mresource_policies[0m[0m    = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m            = "https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/instances/geetass-vm-2" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m                 = [
          [31m-[0m [0m"allow-ssh",
          [31m-[0m [0m"ansible",
          [31m-[0m [0m"env",
          [31m-[0m [0m"http-server",
          [31m-[0m [0m"https-server",
          [31m-[0m [0m"postgres",
          [31m-[0m [0m"ssh",
        ] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags_fingerprint[0m[0m     = "Ev9zU2_Wjvk=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mterraform_labels[0m[0m     = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mzone[0m[0m                 = "asia-southeast1-a" [90m->[0m [0m[90mnull[0m[0m

      [31m-[0m [0mattached_disk {
          [31m-[0m [0m[1m[0mdevice_name[0m[0m  = "extra-disk" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mforce_attach[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmode[0m[0m         = "READ_WRITE" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0msource[0m[0m       = "https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/disks/geetass-vm-2-extra-disk" [90m->[0m [0m[90mnull[0m[0m
        }

      [31m-[0m [0mboot_disk {
          [31m-[0m [0m[1m[0mauto_delete[0m[0m       = true [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mdevice_name[0m[0m       = "persistent-disk-0" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mforce_attach[0m[0m      = false [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mguest_os_features[0m[0m = [
              [31m-[0m [0m"UEFI_COMPATIBLE",
              [31m-[0m [0m"VIRTIO_SCSI_MULTIQUEUE",
              [31m-[0m [0m"GVNIC",
              [31m-[0m [0m"SEV_CAPABLE",
              [31m-[0m [0m"SEV_SNP_CAPABLE",
              [31m-[0m [0m"SEV_LIVE_MIGRATABLE",
              [31m-[0m [0m"SEV_LIVE_MIGRATABLE_V2",
              [31m-[0m [0m"IDPF",
              [31m-[0m [0m"TDX_CAPABLE",
            ] [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmode[0m[0m              = "READ_WRITE" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0msource[0m[0m            = "https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/disks/geetass-vm-2" [90m->[0m [0m[90mnull[0m[0m

          [31m-[0m [0minitialize_params {
              [31m-[0m [0m[1m[0marchitecture[0m[0m                = "X86_64" [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0menable_confidential_compute[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
    
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.